RQs/collection-code/wrk2-logs/w1_rate=2400_2026-02-26 19_18_32_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 3.538ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.471ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.457ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.554ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.425ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.451ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.534ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.509ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.508ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.48ms    1.67ms   9.63ms   90.95%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.03ms
 75.000%    3.70ms
 90.000%    5.03ms
 99.000%    9.63ms
 99.900%   22.88ms
 99.990%   25.61ms
 99.999%   29.93ms
100.000%   29.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.459     0.000000            1         1.00
       2.389     0.100000         1041         1.11
       2.559     0.200000         2084         1.25
       2.707     0.300000         3134         1.43
       2.855     0.400000         4165         1.67
       3.025     0.500000         5209         2.00
       3.117     0.550000         5731         2.22
       3.227     0.600000         6246         2.50
       3.361     0.650000         6773         2.86
       3.517     0.700000         7295         3.33
       3.707     0.750000         7809         4.00
       3.839     0.775000         8067         4.44
       4.003     0.800000         8326         5.00
       4.191     0.825000         8588         5.71
       4.435     0.850000         8847         6.67
       4.719     0.875000         9108         8.00
       4.875     0.887500         9241         8.89
       5.027     0.900000         9367        10.00
       5.203     0.912500         9498        11.43
       5.431     0.925000         9627        13.33
       5.731     0.937500         9758        16.00
       5.887     0.943750         9823        17.78
       6.059     0.950000         9887        20.00
       6.279     0.956250         9953        22.86
       6.523     0.962500        10017        26.67
       6.779     0.968750        10082        32.00
       6.963     0.971875        10115        35.56
       7.211     0.975000        10147        40.00
       7.443     0.978125        10180        45.71
       7.767     0.981250        10212        53.33
       8.175     0.984375        10245        64.00
       8.351     0.985938        10261        71.11
       8.703     0.987500        10277        80.00
       9.287     0.989062        10294        91.43
       9.831     0.990625        10310       106.67
      10.599     0.992188        10326       128.00
      11.695     0.992969        10334       142.22
      12.071     0.993750        10342       160.00
      12.983     0.994531        10351       182.86
      13.519     0.995313        10359       213.33
      14.111     0.996094        10367       256.00
      14.711     0.996484        10371       284.44
      15.327     0.996875        10375       320.00
      16.991     0.997266        10379       365.71
      17.823     0.997656        10383       426.67
      19.567     0.998047        10387       512.00
      20.607     0.998242        10389       568.89
      20.639     0.998437        10391       640.00
      20.975     0.998633        10393       731.43
      21.183     0.998828        10395       853.33
      22.879     0.999023        10397      1024.00
      23.039     0.999121        10398      1137.78
      23.375     0.999219        10399      1280.00
      23.599     0.999316        10400      1462.86
      23.695     0.999414        10401      1706.67
      23.823     0.999512        10402      2048.00
      24.223     0.999561        10403      2275.56
      24.223     0.999609        10403      2560.00
      24.911     0.999658        10404      2925.71
      24.911     0.999707        10404      3413.33
      25.487     0.999756        10405      4096.00
      25.487     0.999780        10405      4551.11
      25.487     0.999805        10405      5120.00
      25.615     0.999829        10406      5851.43
      25.615     0.999854        10406      6826.67
      25.615     0.999878        10406      8192.00
      25.615     0.999890        10406      9102.22
      25.615     0.999902        10406     10240.00
      29.935     0.999915        10407     11702.86
      29.935     1.000000        10407          inf
#[Mean    =        3.480, StdDeviation   =        1.669]
#[Max     =       29.920, Total count    =        10407]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  23892 requests in 10.00s, 4.90MB read
Requests/sec:   2388.87  
Transfer/sec:    501.57KB