RQs/collection-code/wrk2-logs/w1_rate=2800_2026-02-26 19_18_42_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 4.160ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.244ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.266ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.159ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.085ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.053ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.160ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.120ms, rate sampling interval: 12ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.23ms    3.00ms  17.60ms   92.33%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.34ms
 75.000%    4.49ms
 90.000%    6.53ms
 99.000%   17.60ms
 99.900%   33.95ms
 99.990%   46.75ms
 99.999%   50.72ms
100.000%   50.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.722     0.000000            1         1.00
       2.493     0.100000         1381         1.11
       2.705     0.200000         2767         1.25
       2.893     0.300000         4146         1.43
       3.095     0.400000         5525         1.67
       3.341     0.500000         6891         2.00
       3.483     0.550000         7584         2.22
       3.657     0.600000         8275         2.50
       3.875     0.650000         8964         2.86
       4.135     0.700000         9652         3.33
       4.491     0.750000        10343         4.00
       4.703     0.775000        10684         4.44
       4.951     0.800000        11026         5.00
       5.231     0.825000        11377         5.71
       5.575     0.850000        11718         6.67
       6.023     0.875000        12061         8.00
       6.267     0.887500        12232         8.89
       6.527     0.900000        12404        10.00
       6.855     0.912500        12578        11.43
       7.291     0.925000        12750        13.33
       8.019     0.937500        12921        16.00
       8.439     0.943750        13007        17.78
       8.911     0.950000        13093        20.00
       9.399     0.956250        13180        22.86
      10.103     0.962500        13266        26.67
      10.927     0.968750        13353        32.00
      11.367     0.971875        13395        35.56
      12.111     0.975000        13438        40.00
      12.823     0.978125        13481        45.71
      13.495     0.981250        13524        53.33
      14.599     0.984375        13567        64.00
      15.439     0.985938        13589        71.11
      16.359     0.987500        13610        80.00
      17.103     0.989062        13632        91.43
      18.239     0.990625        13653       106.67
      19.263     0.992188        13675       128.00
      19.855     0.992969        13686       142.22
      20.799     0.993750        13697       160.00
      21.775     0.994531        13707       182.86
      22.511     0.995313        13718       213.33
      23.695     0.996094        13729       256.00
      24.607     0.996484        13734       284.44
      25.231     0.996875        13739       320.00
      25.823     0.997266        13745       365.71
      26.639     0.997656        13750       426.67
      30.863     0.998047        13756       512.00
      31.519     0.998242        13758       568.89
      31.871     0.998437        13761       640.00
      32.623     0.998633        13764       731.43
      33.151     0.998828        13766       853.33
      35.263     0.999023        13769      1024.00
      35.711     0.999121        13770      1137.78
      37.151     0.999219        13772      1280.00
      38.847     0.999316        13773      1462.86
      39.871     0.999414        13774      1706.67
      41.087     0.999512        13776      2048.00
      41.087     0.999561        13776      2275.56
      41.311     0.999609        13777      2560.00
      41.631     0.999658        13778      2925.71
      41.631     0.999707        13778      3413.33
      43.135     0.999756        13779      4096.00
      43.135     0.999780        13779      4551.11
      46.335     0.999805        13780      5120.00
      46.335     0.999829        13780      5851.43
      46.335     0.999854        13780      6826.67
      46.751     0.999878        13781      8192.00
      46.751     0.999890        13781      9102.22
      46.751     0.999902        13781     10240.00
      46.751     0.999915        13781     11702.86
      46.751     0.999927        13781     13653.33
      50.719     0.999939        13782     16384.00
      50.719     1.000000        13782          inf
#[Mean    =        4.231, StdDeviation   =        3.004]
#[Max     =       50.688, Total count    =        13782]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  27874 requests in 10.00s, 5.72MB read
Requests/sec:   2786.56  
Transfer/sec:    585.07KB